//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//
// Низове и операции с тях
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//
// създава променливата firstName
var firstName;

// записва низът "Ada" в firstName
// firstName = "Ada";

// създава променливата lastName и записва низът "Byron" в нея
var lastName = "Byron";

// създава променливата fullName и записва в нея "Ada Byron", като конкатенираме двата низа със спейс между тях:
var fullName = firstName + " " + lastName;

// показва в конзолата на браузъра стойността на променливата fullName:
console.log("fullName: ", fullName); // "Ада Бърон"

// принтираме  празен ред в конзолата
console.log("\n");

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//
// Числови данни
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//
// цяло, положително число
var answer = 42;
console.log("answer: ", answer);

// цяло, отрицателно число
var balance = -10000;
console.log("balance: ", balance);

// реално, с плаваща запетая (floating-poin number)
const pi = 3.14159;
console.log("pi: ", pi);

// записваме празен ред в конзолата
console.log("\n");

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//
// Аритметични операции
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~//
// Задача 1: 
// Напишете 2 примера за операцията "Делене по модул".

// Пример : Изчисляване на ДДС:
// разгледайте и осмислете как работи кода даден по-долу:
// цена с включено ДДС
var vatIncludedPrice = 3845.76;
console.log("цена с включено ДДС: " + vatIncludedPrice);

// изчисляване на основната цената (без ДДС):
var basePrice = vatIncludedPrice / 1.2;
console.log("основна цена (без ДДС): " + basePrice);

// изчисляване на ДДС
var vat = 20/100 * basePrice;
console.log("ДДС (вариант 1): " + vat);

// изчисляване на ДДС - кратък начин
vat = vatIncludedPrice / 6;
console.log("ДДС (вариант 2): " + vat);